using System.Collections;
using System.Collections.Generic;

// 플레리어 스프라이트에 관한 설명을 할 것임.

// 스프라이트 왼쪽 위부터 시작해서 1 : 플레이어 기본 스프라이트
  //                              2 : 플레이어 미래 예지 시 눈을 감는 스프라이트
     //                           3 ~ 10 : 플레이어 Dead 애나메이션 
       //                         11 ~ 14 : 플레이어 체공 시 나오는 날개 퍼덕임 애니메이션 
          //                      15 ~ 17 : 플레이어 점프 입력 시 나오는 애니메이션
          //                      18 ~ 20 : 플레이어가 점프 하고 바닥에 닿을 시 나오는 애니메이션 ( 이 애니메이션이 나올때 움직일 수 없음 )
           //                     21 ~ 27 : 플레이어 이동 애니메이션 
                                